calm water resistance/KCS/Fr0.1083/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.66586261827254 0 -8.147701454595854)
	(21.99879392740881 0 -8.147701454595854)
	(21.99879392740881 9.020669467588267 -8.147701454595854)
	(-14.66586261827254 9.020669467588267 -8.147701454595854)
	(-14.66586261827254 0 3.7828613896337893)
	(21.99879392740881 0 3.7828613896337893)
	(21.99879392740881 9.020669467588267 3.7828613896337893)
	(-14.66586261827254 9.020669467588267 3.7828613896337893)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (126 31 41) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

